mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_device.h
/*! ========================================================================
 *  \struct ADI_SUBSYS_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_SUBSYS_TypeDef
{
    volatile       uint32_t SRAMCON;                         /**< 0 SRAM Control Register */
    volatile const uint8_t RESERVED0[8];                   
    volatile       uint32_t SRAMECCCON;                      /**< C SRAM ECC Control Register */
    volatile const uint32_t SRAMECCSTA;                      /**< 10 SRAM ECC Status Register */
    volatile const uint32_t SRAMECCA0;                       /**< 14 SRAM0 ECC Error Address Register */
    volatile const uint32_t SRAMECCD0;                       /**< 18 SRAM0 ECC Error Data Register */
    volatile const uint32_t SRAMECCP0;                       /**< 1C SRAM0 ECC Error Parity Register */
    volatile const uint32_t SRAMECCA1;                       /**< 20 SRAM1 ECC Error Address Register */
    volatile const uint32_t SRAMECCD1;                       /**< 24 SRAM1 ECC Error Data Register */
    volatile const uint32_t SRAMECCP1;                       /**< 28 SRAM1 ECC Error Parity Register */
    volatile const uint32_t SRAMECCA2;                       /**< 2C SRAM2 ECC Error Address Register */
    volatile const uint32_t SRAMECCD2;                       /**< 30 SRAM2 ECC Error Data Register */
    volatile const uint32_t SRAMECCP2;                       /**< 34 SRAM2 ECC Error Parity Register */
} ADI_SUBSYS_TypeDef;

/*! ========================================================================
 *  \struct ADI_CRC_TypeDef
 *  \brief CRC Accelerator
 *  ======================================================================== */
typedef struct _ADI_CRC_TypeDef
{
    volatile       uint32_t CTL;                             /**< 0 CRC Control Register */
    volatile       int32_t IPDATA;                          /**< 4 Input Data Word Register */
    volatile       int32_t RESULT;                          /**< 8 CRC Result Register */
    volatile       uint32_t POLY;                            /**< C Programmable CRC Polynomial */
} ADI_CRC_TypeDef;

/*! ========================================================================
 *  \struct ADI_ADC_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_ADC_TypeDef
{
    volatile const uint32_t ADCDAT0;                         /**< 0 ADCx Data and Flags */
    volatile const uint32_t ADCDAT1;                         /**< 4 ADCx Data and Flags */
    volatile const uint32_t ADCDAT2;                         /**< 8 ADCx Data and Flags */
    volatile const uint32_t ADCDAT3;                         /**< C ADCx Data and Flags */
    volatile const uint32_t ADCDAT4;                         /**< 10 ADCx Data and Flags */
    volatile const uint32_t ADCDAT5;                         /**< 14 ADCx Data and Flags */
    volatile const uint32_t ADCDAT6;                         /**< 18 ADCx Data and Flags */
    volatile const uint32_t ADCDAT7;                         /**< 1C ADCx Data and Flags */
    volatile const uint32_t ADCDAT8;                         /**< 20 ADCx Data and Flags */
    volatile const uint32_t ADCDAT9;                         /**< 24 ADCx Data and Flags */
    volatile const uint32_t ADCDAT10;                        /**< 28 ADCx Data and Flags */
    volatile const uint32_t ADCDAT11;                        /**< 2C ADCx Data and Flags */
    volatile const uint32_t ADCDAT12;                        /**< 30 ADCx Data and Flags */
    volatile const uint32_t ADCDAT13;                        /**< 34 ADCx Data and Flags */
    volatile const uint32_t ADCDAT14;                        /**< 38 ADCx Data and Flags */
    volatile const uint32_t ADCDAT15;                        /**< 3C ADCx Data and Flags */
    volatile const uint32_t ADCDAT16;                        /**< 40 ADCx Data and Flags */
    volatile const uint32_t ADCDAT17;                        /**< 44 ADCx Data and Flags */
    volatile const uint32_t ADCDAT18;                        /**< 48 ADCx Data and Flags */
    volatile const uint32_t ADCDAT19;                        /**< 4C ADCx Data and Flags */
    volatile const uint32_t ADCDAT20;                        /**< 50 ADCx Data and Flags */
    volatile const uint32_t ADCDAT21;                        /**< 54 ADCx Data and Flags */
    volatile const uint32_t ADCDAT22;                        /**< 58 ADCx Data and Flags */
    volatile const uint32_t ADCDAT23;                        /**< 5C ADCx Data and Flags */
    volatile const uint32_t ADCDAT24;                        /**< 60 ADCx Data and Flags */
    volatile const uint32_t ADCDAT25;                        /**< 64 ADCx Data and Flags */
    volatile const uint32_t ADCDAT26;                        /**< 68 ADCx Data and Flags */
    volatile const uint32_t ADCDAT27;                        /**< 6C ADCx Data and Flags */
    volatile const uint32_t ADCDAT28;                        /**< 70 ADCx Data and Flags */
    volatile const uint32_t ADCDAT29;                        /**< 74 ADCx Data and Flags */
    volatile       uint32_t ADCCON;                          /**< 78 ADC Configuration */
    volatile       uint32_t PREBUFCON;                       /**< 7C Pre-charge Buffer Control */
    volatile       uint32_t ADCCNVC;                         /**< 80 ADC Conversion Cycle for Positive Input Channels */
    volatile       uint32_t ADCCNVCSLOW;                     /**< 84 ADC Conversion Cycle for Positive Input Channels */
    volatile       uint32_t ADCCHA;                          /**< 88 ADC Channel Select */
    volatile const uint32_t ADCIRQSTAT;                      /**< 8C ADC Interrupt Status */
    volatile       uint32_t ADCSEQ;                          /**< 90 ADC Sequencer Control */
    volatile       uint32_t ADCSEQC;                         /**< 94 ADC Sequencer Configuration */
    volatile const uint32_t ADCSEQS;                         /**< 98 ADC Sequencer Status */
    volatile       uint32_t ADCSEQCH;                        /**< 9C ADC Sequencer Channel 0 */
    volatile       uint32_t ADCSEQCHMUX0;                    /**< A0 ADC Sequencer Channel 1 */
    volatile       uint32_t ADCSEQCHMUX1;                    /**< A4 ADC Sequencer Channel 1 */
    volatile       uint32_t ADCCMP;                          /**< A8 Digital Comparator 0 Configuration */
    volatile       uint32_t ADCCMPIRQSTAT;                   /**< AC Digital Comparator Interrupt Status */
    volatile       uint32_t ADCOFGNDIFF;                     /**< B0 ADC Offset Gain Differential Channel Error Correction */
    volatile       uint32_t ADCOFTEMP;                       /**< B4 ADC Offset Gain Temp Sensor Channel Error Correction */
    volatile       uint32_t ADCGNTEMP;                       /**< B8 ADC Offset Gain Temp Sensor Channel Error Correction */
    volatile       uint32_t ADCOFGNPGA0;                     /**< BC ADC Offset Gain PGA0 Channel Error Correction */
    volatile       uint32_t ADCOFGNPGA1;                     /**< C0 ADC Offset Gain PGA1 Channel Error Correction */
    volatile       uint32_t ADCOFGNPGA2;                     /**< C4 ADC Offset Gain PGA2 Channel Error Correction */
    volatile       uint32_t ADCOFGNPGA3;                     /**< C8 ADC Offset Gain PGA3 Channel Error Correction */
    volatile const uint8_t RESERVED0[136];                 
    volatile       uint32_t ADCCMP1;                         /**< 154 Digital Comparator 1 Configuration */
    volatile       uint32_t ADCCMP2;                         /**< 158 Digital Comparator 2 Configuration */
    volatile       uint32_t ADCCMP3;                         /**< 15C Digital Comparator 3 Configuration */
} ADI_ADC_TypeDef;

/*! ========================================================================
 *  \struct ADI_COMP_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_COMP_TypeDef
{
    volatile       uint32_t COMPCON0;                        /**< 0 No description provided */
    volatile       uint32_t COMPCON1;                        /**< 4 No description provided */
    volatile       uint32_t COMPCON2;                        /**< 8 No description provided */
    volatile       uint32_t COMPCON3;                        /**< C No description provided */
    volatile const uint32_t COMPIRQSTAT;                     /**< 10 No description provided */
} ADI_COMP_TypeDef;

/*! ========================================================================
 *  \struct ADI_PGA_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_PGA_TypeDef
{
    volatile       uint32_t PGABIASCON;                      /**< 0 PGA Bias Circuit Control Signal */
    volatile const uint8_t RESERVED0[28];                  
    volatile       uint32_t PGA0CON;                         /**< 20 PGA0 Control Register */
    volatile       uint32_t PGA0CHPCON;                      /**< 24 PGA0 Chop Function Ctrl */
    volatile       uint32_t PGA3CHPCON;                      /**< 28 PGA3 Chop Function Ctrl */
    volatile const uint8_t RESERVED1[68];                  
    volatile       uint32_t PGA1CON;                         /**< 70 PGA1 Control Register */
    volatile       uint32_t PGA1CHPCON;                      /**< 74 PGA1 Chop Function Ctrl */
    volatile const uint8_t RESERVED2[40];                  
    volatile       uint32_t PGA2CON;                         /**< A0 PGA2 Control Register */
    volatile       uint32_t PGA2CHPCON;                      /**< A4 PGA2 Chop Function Ctrl */
    volatile const uint8_t RESERVED3[40];                  
    volatile       uint32_t PGA3CON;                         /**< D0 PGA3 Control Register */
} ADI_PGA_TypeDef;

/*! ========================================================================
 *  \struct ADI_PLL_MMRS_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_PLL_MMRS_TypeDef
{
    volatile       uint32_t PLLPDCTRL;                       /**< 0 No description provided */
} ADI_PLL_MMRS_TypeDef;

/*! ========================================================================
 *  \struct ADI_VCM_MMRS_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_VCM_MMRS_TypeDef
{
    volatile       uint32_t TMPSNSCON;                       /**< 0 No description provided */
    volatile       uint32_t TMPSNSCHPCON;                    /**< 4 No description provided */
    volatile       uint32_t VCMREFCON;                       /**< 8 No description provided */
    volatile const uint8_t RESERVED0[4];                   
    volatile       uint32_t VCMBUFCON;                       /**< 10 No description provided */
} ADI_VCM_MMRS_TypeDef;

/*! ========================================================================
 *  \struct ADI_DAC_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_DAC_TypeDef
{
    volatile       uint32_t DACCON0;                         /**< 0 DAC Control Register */
    volatile       uint32_t DACCON1;                         /**< 4 DAC Control Register */
    volatile       uint32_t DACCON2;                         /**< 8 DAC Control Register */
    volatile       uint32_t DACCON3;                         /**< C DAC Control Register */
    volatile       uint32_t DACCON4;                         /**< 10 DAC Control Register */
    volatile       uint32_t DACCON5;                         /**< 14 DAC Control Register */
    volatile       uint32_t DACCON6;                         /**< 18 DAC Control Register */
    volatile       uint32_t DACCON7;                         /**< 1C DAC Control Register */
    volatile       uint32_t DACCON8;                         /**< 20 DAC Control Register */
    volatile       uint32_t DACCON9;                         /**< 24 DAC Control Register */
    volatile       uint32_t DACCON10;                        /**< 28 DAC Control Register */
    volatile       uint32_t DACCON11;                        /**< 2C DAC Control Register */
    volatile       uint32_t DACDAT0;                         /**< 30 DAC Data Register */
    volatile       uint32_t DACDAT1;                         /**< 34 DAC Data Register */
    volatile       uint32_t DACDAT2;                         /**< 38 DAC Data Register */
    volatile       uint32_t DACDAT3;                         /**< 3C DAC Data Register */
    volatile       uint32_t DACDAT4;                         /**< 40 DAC Data Register */
    volatile       uint32_t DACDAT5;                         /**< 44 DAC Data Register */
    volatile       uint32_t DACDAT6;                         /**< 48 DAC Data Register */
    volatile       uint32_t DACDAT7;                         /**< 4C DAC Data Register */
    volatile       uint32_t DACDAT8;                         /**< 50 DAC Data Register */
    volatile       uint32_t DACDAT9;                         /**< 54 DAC Data Register */
    volatile       uint32_t DACDAT10;                        /**< 58 DAC Data Register */
    volatile       uint32_t DACDAT11;                        /**< 5C DAC Data Register */
} ADI_DAC_TypeDef;


/*  =========================================================================
 * Peripheral Memory Map Declarations
 *  ========================================================================= */

#define ADI_GPT0_BASE                       (0x40000000U)    /* Base address of gpt0: */
#define ADI_GPT1_BASE                       (0x40000400U)    /* Base address of gpt1: */
#define ADI_GPT2_BASE                       (0x40000800U)    /* Base address of gpt2: */
#define ADI_GPTH0_BASE                      (0x40000C00U)    /* Base address of gpth0: */
#define ADI_GPTH1_BASE                      (0x40001000U)    /* Base address of gpth1: */
#define ADI_MISC_BASE                       (0x40002000U)    /* Base address of misc: */
#define ADI_WUT_BASE                        (0x40003000U)    /* Base address of wut: */
#define ADI_WDT_BASE                        (0x40004000U)    /* Base address of wdt: */
#define ADI_ALLON_BASE                      (0x40005000U)    /* Base address of allon: */
#define ADI_PLA_BASE                        (0x40006000U)    /* Base address of pla: */
#define ADI_DMAREQ_BASE                     (0x40007000U)    /* Base address of dmareq: */
#define ADI_UART0_BASE                      (0x40020000U)    /* Base address of uart0: */
#define ADI_UART1_BASE                      (0x40020400U)    /* Base address of uart1: */
#define ADI_I2C0_BASE                       (0x40020800U)    /* Base address of i2c0: */
#define ADI_I2C1_BASE                       (0x40020C00U)    /* Base address of i2c1: */
#define ADI_I2C2_BASE                       (0x40021000U)    /* Base address of i2c2: */
#define ADI_MDIO_BASE                       (0x40022000U)    /* Base address of mdio: */
#define ADI_DMA_BASE                        (0x40040000U)    /* Base address of dma: */
#define ADI_CACHE_BASE                      (0x40044000U)    /* Base address of cache: */
#define ADI_FLASH_BASE                      (0x40048000U)    /* Base address of flash: */
#define ADI_GPIO0_BASE                      (0x40050000U)    /* Base address of gpio0: */
#define ADI_GPIO1_BASE                      (0x40050050U)    /* Base address of gpio1: */
#define ADI_GPIO2_BASE                      (0x400500A0U)    /* Base address of gpio2: */
#define ADI_GPIO3_BASE                      (0x400500F0U)    /* Base address of gpio3: */
#define ADI_GPIO4_BASE                      (0x40050140U)    /* Base address of gpio4: */
#define ADI_GPIO5_BASE                      (0x40050190U)    /* Base address of gpio5: */
#define ADI_GPIO6_BASE                      (0x400501E0U)    /* Base address of gpio6: */
#define ADI_GPIO7_BASE                      (0x40050230U)    /* Base address of gpio7: */
#define ADI_GPIO8_BASE                      (0x40050280U)    /* Base address of gpio8: */
#define ADI_SPI0_BASE                       (0x40054000U)    /* Base address of spi0: */
#define ADI_SPI1_BASE                       (0x40058000U)    /* Base address of spi1: */
#define ADI_SPI2_BASE                       (0x4005C000U)    /* Base address of spi2: */
#define ADI_CLK_BASE                        (0x40060000U)    /* Base address of clk: */
#define ADI_PWM_BASE                        (0x40064000U)    /* Base address of pwm: */
#define ADI_SRAM_BASE                       (0x40065000U)    /* Base address of sram: */
#define ADI_CRC_BASE                        (0x40066000U)    /* Base address of crc: */
#define ADI_ADC_BASE                        (0x40068000U)    /* Base address of adc: */
#define ADI_COMP_BASE                       (0x40068A00U)    /* Base address of comp: */
#define ADI_PGA_BASE                        (0x40069000U)    /* Base address of pga: */
#define ADI_PLL_BASE                        (0x40069200U)    /* Base address of pll: */
#define ADI_TMPSNS_BASE                     (0x40069600U)    /* Base address of tmpsns: */
#define ADI_VDAC_BASE                       (0x40069800U)    /* Base address of vdac: */


/*  =========================================================================
 * Peripheral Pointer Declarations
 *  ========================================================================= */

#define pADI_GPT0                           ((ADI_TMR_TypeDef *) ADI_GPT0_BASE)                   /* Pointer to  (gpt0)*/
#define pADI_GPT1                           ((ADI_TMR_TypeDef *) ADI_GPT1_BASE)                   /* Pointer to  (gpt1)*/
#define pADI_GPT2                           ((ADI_TMR_TypeDef *) ADI_GPT2_BASE)                   /* Pointer to  (gpt2)*/
#define pADI_GPTH0                          ((ADI_TIMER_TypeDef *) ADI_GPTH0_BASE)                /* Pointer to  (gpth0)*/
#define pADI_GPTH1                          ((ADI_TIMER_TypeDef *) ADI_GPTH1_BASE)                /* Pointer to  (gpth1)*/
#define pADI_MISC                           ((ADI_MISC16_TypeDef *) ADI_MISC_BASE)                /* Pointer to  (misc)*/
#define pADI_WUT                            ((ADI_WUT_TypeDef *) ADI_WUT_BASE)                    /* Pointer to  (wut)*/
#define pADI_WDT                            ((ADI_WDT_TypeDef *) ADI_WDT_BASE)                    /* Pointer to  (wdt)*/
#define pADI_ALLON                          ((ADI_ALWAYS_ON_TypeDef *) ADI_ALLON_BASE)            /* Pointer to  (allon)*/
#define pADI_PLA                            ((ADI_PLA_TypeDef *) ADI_PLA_BASE)                    /* Pointer to  (pla)*/
#define pADI_DMAREQ                         ((ADI_DMAREQ_TypeDef *) ADI_DMAREQ_BASE)              /* Pointer to  (dmareq)*/
#define pADI_UART0                          ((ADI_UART_TypeDef *) ADI_UART0_BASE)                 /* Pointer to  (uart0)*/
#define pADI_UART1                          ((ADI_UART_TypeDef *) ADI_UART1_BASE)                 /* Pointer to  (uart1)*/
#define pADI_I2C0                           ((ADI_I2C_TypeDef *) ADI_I2C0_BASE)                   /* Pointer to  (i2c0)*/
#define pADI_I2C1                           ((ADI_I2C_TypeDef *) ADI_I2C1_BASE)                   /* Pointer to  (i2c1)*/
#define pADI_I2C2                           ((ADI_I2C_TypeDef *) ADI_I2C2_BASE)                   /* Pointer to  (i2c2)*/
#define pADI_MDIO                           ((ADI_MDIO_TypeDef *) ADI_MDIO_BASE)                  /* Pointer to  (mdio)*/
#define pADI_DMA                            ((ADI_DMA_TypeDef *) ADI_DMA_BASE)                    /* Pointer to  (dma)*/
#define pADI_CACHE                          ((ADI_CC_TypeDef *) ADI_CACHE_BASE)                   /* Pointer to  (cache)*/
#define pADI_FLASH                          ((ADI_FLASH_TypeDef *) ADI_FLASH_BASE)                /* Pointer to  (flash)*/
#define pADI_GPIO0                          ((ADI_GPIO_TypeDef *) ADI_GPIO0_BASE)                 /* Pointer to  (gpio0)*/
#define pADI_GPIO1                          ((ADI_GPIO_TypeDef *) ADI_GPIO1_BASE)                 /* Pointer to  (gpio1)*/
#define pADI_GPIO2                          ((ADI_GPIO_TypeDef *) ADI_GPIO2_BASE)                 /* Pointer to  (gpio2)*/
#define pADI_GPIO3                          ((ADI_GPIO_TypeDef *) ADI_GPIO3_BASE)                 /* Pointer to  (gpio3)*/
#define pADI_GPIO4                          ((ADI_GPIO_TypeDef *) ADI_GPIO4_BASE)                 /* Pointer to  (gpio4)*/
#define pADI_GPIO5                          ((ADI_GPIO_TypeDef *) ADI_GPIO5_BASE)                 /* Pointer to  (gpio5)*/
#define pADI_GPIO6                          ((ADI_GPIO_TypeDef *) ADI_GPIO6_BASE)                 /* Pointer to  (gpio6)*/
#define pADI_GPIO7                          ((ADI_GPIO_TypeDef *) ADI_GPIO7_BASE)                 /* Pointer to  (gpio7)*/
#define pADI_GPIO8                          ((ADI_GPIO_TypeDef *) ADI_GPIO8_BASE)                 /* Pointer to  (gpio8)*/
#define pADI_SPI0                           ((ADI_SPI_TypeDef *) ADI_SPI0_BASE)                   /* Pointer to  (spi0)*/
#define pADI_SPI1                           ((ADI_SPI_TypeDef *) ADI_SPI1_BASE)                   /* Pointer to  (spi1)*/
#define pADI_SPI2                           ((ADI_SPI_TypeDef *) ADI_SPI2_BASE)                   /* Pointer to  (spi2)*/
#define pADI_CLK                            ((ADI_CLOCK_TypeDef *) ADI_CLK_BASE)                  /* Pointer to  (clk)*/
#define pADI_PWM                            ((ADI_PWM_TypeDef *) ADI_PWM_BASE)                    /* Pointer to  (pwm)*/
#define pADI_SRAM                           ((ADI_SUBSYS_TypeDef *) ADI_SRAM_BASE)                /* Pointer to  (sram)*/
#define pADI_CRC                            ((ADI_CRC_TypeDef *) ADI_CRC_BASE)                    /* Pointer to  (crc)*/
#define pADI_ADC                            ((ADI_ADC_TypeDef *) ADI_ADC_BASE)                    /* Pointer to  (adc)*/
#define pADI_COMP                           ((ADI_COMP_TypeDef *) ADI_COMP_BASE)                  /* Pointer to  (comp)*/
#define pADI_PGA                            ((ADI_PGA_TypeDef *) ADI_PGA_BASE)                    /* Pointer to  (pga)*/
#define pADI_PLL                            ((ADI_PLL_MMRS_TypeDef *) ADI_PLL_BASE)               /* Pointer to  (pll)*/
#define pADI_TMPSNS                         ((ADI_VCM_MMRS_TypeDef *) ADI_TMPSNS_BASE)            /* Pointer to  (tmpsns)*/
#define pADI_VDAC                           ((ADI_DAC_TypeDef *) ADI_VDAC_BASE)                   /* Pointer to  (vdac)*/


/*  =========================================================================
 *! \enum   IRQn_Type
 *! \brief  Interrupt Number Assignments
 *  ========================================================================= */

