mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_device.h
typedef enum
{
    RESET_IRQn                                  =   -15,    /*!<* RESET */
    NonMaskableInt_IRQn                         =   -14,    /*!<* NonMaskableInt */
    HardFault_IRQn                              =   -13,    /*!<* HardFault */
    MemoryManagement_IRQn                       =   -12,    /*!<* MemoryManagement */
    BusFault_IRQn                               =   -11,    /*!<* BusFault */
    UsageFault_IRQn                             =   -10,    /*!<* UsageFault */
    SVCall_IRQn                                 =    -5,    /*!<* SVCall */
    DebugMonitor_IRQn                           =    -4,    /*!<* DebugMonitor */
    PendSV_IRQn                                 =    -2,    /*!<* PendSV */
    SysTick_IRQn                                =    -1,    /*!<* SysTick */
    WUT_IRQn                                    =     0,    /*!<* WUT */
    EINT0_IRQn                                  =     1,    /*!<* EINT0 */
    EINT1_IRQn                                  =     2,    /*!<* EINT1 */
    EINT2_IRQn                                  =     3,    /*!<* EINT2 */
    EINT3_IRQn                                  =     4,    /*!<* EINT3 */
    EINT4_IRQn                                  =     5,    /*!<* EINT4 */
    EINT5_IRQn                                  =     6,    /*!<* EINT5 */
    EINT6_IRQn                                  =     7,    /*!<* EINT6 */
    EINT7_IRQn                                  =     8,    /*!<* EINT7 */
    EINT8_IRQn                                  =     9,    /*!<* EINT8 */
    EINT9_IRQn                                  =    10,    /*!<* EINT9 */
    WDT_IRQn                                    =    11,    /*!<* WDT */
    GPT0_IRQn                                   =    12,    /*!<* GPT0 */
    GPT1_IRQn                                   =    13,    /*!<* GPT1 */
    GPT2_IRQn                                   =    14,    /*!<* GPT2 */
    GPT3_IRQn                                   =    15,    /*!<* GPT3 */
    GPT4_IRQn                                   =    16,    /*!<* GPT4 */
    MDIO_IRQn                                   =    17,    /*!<* MDIO */
    FLASH_IRQn                                  =    18,    /*!<* FLASH */
    UART0_IRQn                                  =    19,    /*!<* UART0 */
    UART1_IRQn                                  =    20,    /*!<* UART1 */
    SPI0_IRQn                                   =    21,    /*!<* SPI0 */
    SPI1_IRQn                                   =    22,    /*!<* SPI1 */
    SPI2_IRQn                                   =    23,    /*!<* SPI2 */
    I2C0S_IRQn                                  =    24,    /*!<* I2C0S */
    I2C0M_IRQn                                  =    25,    /*!<* I2C0M */
    I2C1S_IRQn                                  =    26,    /*!<* I2C1S */
    I2C1M_IRQn                                  =    27,    /*!<* I2C1M */
    I2C2S_IRQn                                  =    28,    /*!<* I2C2S */
    I2C2M_IRQn                                  =    29,    /*!<* I2C2M */
    PLA0_IRQn                                   =    30,    /*!<* PLA0 */
    PLA1_IRQn                                   =    31,    /*!<* PLA1 */
    PLA2_IRQn                                   =    32,    /*!<* PLA2 */
    PLA3_IRQn                                   =    33,    /*!<* PLA3 */
    PWM_TRIP_IRQn                               =    34,    /*!<* PWM_TRIP */
    PWM0_IRQn                                   =    35,    /*!<* PWM0 */
    PWM1_IRQn                                   =    36,    /*!<* PWM1 */
    PWM2_IRQn                                   =    37,    /*!<* PWM2 */
    PWM3_IRQn                                   =    38,    /*!<* PWM3 */
    SRAM_ERR_IRQn                               =    39,    /*!<* SRAM_ERR */
    DMA_ERR_IRQn                                =    40,    /*!<* DMA_ERR */
    DMA_SPI0_TX_IRQn                            =    41,    /*!<* DMA_SPI0_TX */
    DMA_SPI0_RX_IRQn                            =    42,    /*!<* DMA_SPI0_RX */
    DMA_SPI1_TX_IRQn                            =    43,    /*!<* DMA_SPI1_TX */
    DMA_SPI1_RX_IRQn                            =    44,    /*!<* DMA_SPI1_RX */
    DMA_SPI2_TX_IRQn                            =    45,    /*!<* DMA_SPI2_TX */
    DMA_SPI2_RX_IRQn                            =    46,    /*!<* DMA_SPI2_RX */
    DMA_UART0_TX_IRQn                           =    47,    /*!<* DMA_UART0_TX */
    DMA_UART0_RX_IRQn                           =    48,    /*!<* DMA_UART0_RX */
    DMA_UART1_TX_IRQn                           =    49,    /*!<* DMA_UART1_TX */
    DMA_UART1_RX_IRQn                           =    50,    /*!<* DMA_UART1_RX */
    DMA_I2C0S_TX_IRQn                           =    51,    /*!<* DMA_I2C0S_TX */
    DMA_I2C0S_RX_IRQn                           =    52,    /*!<* DMA_I2C0S_RX */
    DMA_I2C0M_IRQn                              =    53,    /*!<* DMA_I2C0M */
    DMA_I2C1S_TX_IRQn                           =    54,    /*!<* DMA_I2C1S_TX */
    DMA_I2C1S_RX_IRQn                           =    55,    /*!<* DMA_I2C1S_RX */
    DMA_I2C1M_IRQn                              =    56,    /*!<* DMA_I2C1M */
    DMA_I2C2S_TX_IRQn                           =    57,    /*!<* DMA_I2C2S_TX */
    DMA_I2C2S_RX_IRQn                           =    58,    /*!<* DMA_I2C2S_RX */
    DMA_I2C2M_IRQn                              =    59,    /*!<* DMA_I2C2M */
    DMA_MDIO_TX_IRQn                            =    60,    /*!<* DMA_MDIO_TX */
    DMA_MDIO_RX_IRQn                            =    61,    /*!<* DMA_MDIO_RX */
    DMA_FLASH_IRQn                              =    62,    /*!<* DMA_FLASH */
    DMA_ADC_IRQn                                =    63,    /*!<* DMA_ADC */
    PLL_IRQn                                    =    64,    /*!<* PLL */
    HFOSC_IRQn                                  =    65,    /*!<* HFOSC */
    ADC_IRQn                                    =    66,    /*!<* ADC */
    SEQ_IRQn                                    =    67,    /*!<* SEQ */
    COMP0_IRQn                                  =    68,    /*!<* COMP0 */
    COMP1_IRQn                                  =    69,    /*!<* COMP1 */
    COMP2_IRQn                                  =    70,    /*!<* COMP2 */
    COMP3_IRQn                                  =    71,    /*!<* COMP3 */
    VDAC_IRQn                                   =    72,    /*!<* VDAC */
    DMA_TRIG0_IRQn                              =    81,    /*!<* DMA_TRIG0 */
    DMA_TRIG1_IRQn                              =    82,    /*!<* DMA_TRIG1 */
    DMA_SW0_IRQn                                =    83,    /*!<* DMA_SW0 */
    DMA_SW1_IRQn                                =    84,    /*!<* DMA_SW1 */
    CACHE_IRQn                                  =    85,    /*!<* CACHE */
    DIG_COMP_IRQn                               =    86,    /*!<* DIG_COMP */
    GPIO_INTA_IRQn                              =    87,    /*!<* GPIO_INTA */
    GPIO_INTB_IRQn                              =    88,    /*!<* GPIO_INTB */
} IRQn_Type;  /* typedef name for fixed interrupt numbers */




/*  =========================================================================
 *! \enum   DMA_CHANn_TypeDef
 *! \brief  DMAChannel Number Assignments
 *  ========================================================================= */

